Repository: pepr/progit2-cs
Catalog: omegat/tm/auto/progit-omegat-asciidoc.tmx
Source language: en
Languages: cs

source: You should also run this command to pull in changes from the Subversion server, even if you’re not ready to commit yourself.
cs: Tento příkaz byste proto měli používat ke stažení změn ze serveru Subversion i v případě, že ještě sami nehodláte zapsat vlastní revize.

source: You should consider it crippled Git, however, or you’ll hit issues in translation that may confuse you and your collaborators.
cs: Mějte však stále na paměti, že v tomto případě nelze používat systém Git v celé jeho šíři. Mohlo by se stát, že způsobíte chyby v překladu, které znepříjemní život vám i vašim kolegům.

source: You should feel comfortable creating and switching to new branches, switching between branches and merging local branches together.
cs: Neměli byste teď mít problém s vytvářením větví, přepínáním na nové i existující větve ani se slučováním lokálních větví.

source: You should feel comfortable using Git with Subversion or importing nearly any existing repository into a new Git one without losing data.
cs: Po přečtení této kapitoly byste měli hravě zvládat používání systému Git v kombinaci se systémem Subversion a import téměř jakéhokoli existujícího repozitáře do repozitáře Git, aniž by došlo ke ztrátě dat.

source: You should feel fairly comfortable contributing to a project in Git as well as maintaining your own project or integrating other users’ contributions.
cs: V tomto okamžiku byste tedy už měli hravě zvládat přispívání do projektů v systému Git, správu vlastního projektu i integraci příspěvků jiných uživatelů.

source: You should have a basic understanding of what Git is and how it’s different from the CVCS you may have been using.
cs: Nyní byste měli mít základní představu o tom, co je to Git a v čem se liší od systému CVCS, který jste možná dosud používali.

source: You should have a pretty good understanding of what Git does in the background and, to some degree, how it’s implemented.
cs: Jak doufám, udělali jste si v této kapitole názorný obrázek o tom, jak Git pracuje v pozadí, a do určité míry také o jeho implementaci.

source: You should have to do these things only once; they’ll stick around between upgrades.
cs: Nastavení stačí provést pouze jednou — zůstanou zachována i po případných aktualizacích.

source: You should know two important things about `git svn log`.
cs: O příkazu `git svn log` byste měli vědět dvě důležité věci.

source: You should now be able to make Git fit nearly any workflow you can dream up.
cs: Nyní byste měli systém Git bez potíží nastavit téměř na jakýkoli pracovní postup, který si vysníte.

source: You should now have a copy of the Git directory data in your `my_project.git` directory.
cs: V adresáři `my_project.git` byste nyní měli mít kopii dat z adresáře Git.

source: You should only have to use `git apply` for legacy patches and things like that.
cs: Příkaz `git apply` je dobré používat jen pro starší záplaty a podobně.

source: You should see something like this:
cs: Mělo by se zobrazit asi následující:

source: You solve this issue much the same way — edit the file to resolve the conflict, stage the new file, and then run `git am --resolved` to continue to the next patch:
cs: Problém se také řeší stejným způsobem. Úpravou souboru odstraňte konflikt, připravte nový soubor k zapsání a spusťte příkaz `git am --resolved`, jímž se přesunete k následující záplatě:

source: You stage the changes you want by editing a file and running `git add` on it or `git rm` to a tracked file, and the subsequent `git commit --amend` takes your current staging area and makes it the snapshot for the new commit.
cs: Změny, které chcete zapsat, připravíte tím způsobem, že upravíte příslušné soubory a použijete na ně příkaz `git add`, resp. `git rm`. Příkaz `git commit --amend` poté vezme vaši oblast připravených změn v aktuální podobě a vytvoří snímek nové revize.

source: You stage the files, adding snapshots of them to your staging area.
cs: Soubory připravíte k uložení tak, že vložíte jejich snímky do oblasti připravených změn.

source: You start a new branch based off the current `origin/master` branch, squash the `featureB` changes there, resolve any conflicts, make the implementation change, and then push that up as a new branch:
cs: Začnete vytvořením nové větve z aktuální větve `origin/master`, zkomprimujete do ní změny z větve `featureB`, vyřešíte všechny konflikty, provedete změnu v implementaci a to vše odešlete jako novou větev:

source: You stick the bare repository copy somewhere everyone has shared access to and set the read/write permissions as you would for any other shared directory.
cs: Kopii holého repozitáře umístíte někam, kam mají všichni sdílený přístup, a nastavíte oprávnění ke čtení/zápisu stejně jako u jakéhokoli jiného sdíleného adresáře.

source: You still get the advantages of things like offline committing and vastly simpler branching and merging, but the workflow can be very similar; the main difference is that merges happen client-side rather than on the server at commit time.
cs: Se systémem Git ale budete stále ještě ve výhodě v takových ohledech, jako je zapisování revizí offline a podstatně snazší větvení a slučování. Pracovní postup však bude velmi podobný. Hlavním rozdílem je to, že slučování probíhá na straně klienta, ne během zapisování revize na straně serveru.

source: You then fetch from that server, bringing down the new commits.
cs: Vy poté znovu vyzvednete data ze serveru a stáhnete nové revize.

source: You then need to add in this new repository URL as a second remote, in this case named `myfork`:
cs: Poté bude třeba, abyste tuto novou adresu URL repozitáře přidali jako druhý vzdálený repozitář, v tomto případě pojmenovaný `myfork`:

source: You use `git format-patch` to generate the mbox-formatted files that you can e-mail to the list — it turns each commit into an e-mail message with the first line of the commit message as the subject and the rest of the message plus the patch that the commit introduces as the body.
cs: Pro vygenerování emailových zpráv ve formátu mbox použijte příkaz `git format-patch`. Každá revize se přetransformuje na e-mailovou zprávu, jejíž předmět bude tvořit první řádek zprávy k revizi a tělo e-mailu bude tvořeno zbytkem zprávy a samotnou záplatou.

source: You use this command to artificially add the earlier version of the test.txt file to a new staging area.
cs: Tento příkaz lze použít, jestliže chcete uměle přidat starší verzi souboru test.txt do nové oblasti připravených změn.

source: You want to pull the Rack project into your `master` project as a subdirectory.
cs: Projekt Rack chcete do projektu `master` natáhnout jako podadresář.

source: You want to see what is in your experiment branch that hasn’t yet been merged into your master branch.
cs: Vy chcete vidět, co všechno obsahuje vaše experimentální větev, kterou jste ještě nezačlenili do hlavní větve.

source: You want to work on this project with your friends, so you’ll have to re-add their public keys.
cs: Na tomto projektu chcete spolupracovat s přáteli, a proto budete muset znovu přidat jejich veřejné klíče.

source: You will have to explicitly push tags to a shared server after you have created them.
cs: Pokud jste vytvořili značku, budete ji muset na sdílený server poslat explicitně.

source: You will see these hash values all over the place in Git because it uses them so much.
cs: S těmito otisky se budete setkávat ve všech úložištích systému Git, protože je používá opravdu často.

source: You work for a while, generally in a topic branch, and merge into your `master` branch when it’s ready to be integrated.
cs: Po určitou dobu pracujete, obvykle na nějaké tematické větvi, a když je připravena k integraci, začleníte ji do své větve `master`.

source: You work on your web site and do some commits.
cs: Pracujete na webových stránkách a zapíšete několik revizí.

source: Your Git repository now contains five objects: one blob for the contents of each of your three files, one tree that lists the contents of the directory and specifies which file names are stored as which blobs, and one commit with the pointer to that root tree and all the commit metadata.
cs: Váš gitovský repozitář nyní obsahuje pět objektů: jeden blob pro obsah každého ze tří vašich souborů, jeden strom, který zaznamenává obsah adresáře a udává, které názvy souborů jsou uloženy jako který blob, a jeden objekt revize s ukazatelem na kořenový strom a se všemi metadaty revize.

source: Your Subversion import looks like it has a remote named tags with branches under it.
cs: Import ze systému Subversion vypadá, jako by měl vzdálený repozitář s názvem „tags“, v němž se nacházejí jednotlivé větve.

source: Your `inline_data` method looks like this:
cs: Metoda `inline_data` má tuto podobu:

source: Your basic main loop looks like this:
cs: Základní smyčka bude mít tuto podobu:

source: Your branch will contain only work from that commit down:
cs: Vaše větev bude obsahovat pouze práci od této revize níže:

source: Your change is now in the snapshot of the commit pointed to by the `master` branch, and you can deploy your change (see Figure 3-14).
cs: Vaše změna je nyní obsažena ve snímku revize, na niž ukazuje hlavní větev `master`, a vy můžete pokračovat v provádění změn (viz obrázek 3-14).

source: Your commit history looks like Figure 3-36.
cs: Vaše historie revizí bude vypadat jako na obrázku 3-36.

source: Your commit history will look something like Figure 3-20.
cs: Historie revizí bude vypadat zhruba jako na obrázku 3-20.

source: Your commit history with multiple topic branches.
cs: Historie revizí s několika tematickými větvemi

source: Your database contains the two new versions of the file as well as the first content you stored there:
cs: Vaše databáze obsahuje dvě nové verze souboru a počáteční obsah, který jste do ní vložili:

source: Your directory structure looks like this:
cs: Váš adresář má tuto strukturu:

source: Your file contains a section that looks something like this:
cs: Jedna část vašeho souboru bude vypadat zhruba takto:

source: Your first challenge is to enforce that each commit message must adhere to a particular format.
cs: Vaším prvním úkolem bude zajistit, aby všechny zprávy k revizím splňovaly předepsaný formát.

source: Your first line starts with 005b, which is 91 in decimal, meaning that 91 bytes remain on that line.
cs: Váš první řádek začíná hodnotou 005b, tedy 91 v hexadecimální soustavě, což znamená, že na tomto řádku zbývá 91 bytů.

source: Your fork of a project.
cs: Vaše rozštěpení projektu

source: Your history after merging in dumbidea and iss91v2.
cs: Vaše historie po začlenění větví „dumbidea“ a „iss91v2“

source: Your history no longer contains a reference to that file.
cs: Vaše historie už neobsahuje referenci na problémový soubor.

source: Your history then looks like Figure 3-21.
cs: Vaši historii v tomto stavu znázorňuje obrázek 3-21.

source: Your import is ready to push up to your new Git server.
cs: Váš import je připraven k odeslání na nový server Git.

source: Your initial diverged commit history.
cs: Vaše původně rozdělená historie revizí

source: Your iss53 branch can move forward independently.
cs: Větev iss53 může nezávisle postupovat vpřed.

source: Your local branches aren’t automatically synchronized to the remotes you write to — you have to explicitly push the branches you want to share.
cs: Vaše lokální větve nejsou automaticky synchronizovány se vzdálenými servery, na něž zapisujete – ty, které chcete sdílet, musíte explicitně odeslat.

source: Your master branch points to the same place as your hotfix branch after the merge.
cs: Hlavní větev ukazuje po sloučení na stejné místo jako větev „hotfix“.

source: Your method looks like this:
cs: Celý postup vypadá takto:

source: Your mileage may vary.
cs: Je to případ od případu.

source: Your object is there, so go ahead and get the whole packfile:
cs: Váš objekt se v tomto souboru nachází, a proto neváhejte a stáhněte celý balíčkový soubor:

source: Your staging area now has the new version of test.txt as well as the new file new.txt.
cs: V oblasti připravených změn nyní máte jak novou verzi souboru test.txt, tak nový soubor new.txt.

source: Your strategy will be to go through the snapshots one at a time and create commits with the contents of each directory, linking each commit back to the previous one.
cs: Vaše strategie tedy bude spočívat v tom, že postupně projdete jednotlivé snímky a vytvoříte revize s obsahem každého adresáře, přičemž každá revize bude odkazovat na revizi předchozí.

source: Your working directory is clean:
cs: Váš pracovní adresář se vyčistil:

source: You’ll add a new section called `mobile` where you’ll list the developers on your mobile team and projects that those developers need access to.
cs: Přidáte novou část s názvem `mobile`, která bude obsahovat seznam vývojářů vašeho mobilního týmu a projektů, k nimž tito vývojáři potřebují přístup.

source: You’ll add some larger content to the repository to demonstrate an interesting feature of Git.
cs: Do repozitáře tak nyní přidáme větší objem dat, na němž si budeme moci ukázat jednu zajímavou funkci systému Git.

source: You’ll also need to set the Unix user group of the `/opt/git` directories to `www-data` so your web server can read-access the repositories, because the Apache instance running the CGI script will (by default) be running as that user:
cs: Budete také muset nastavit uživatelskou skupinu adresáře `/opt/git` na `www-data`. Váš webový server tak získá přístup pro čtení k repozitářům, protože instance Apache, která spouští CGI skript, bude (standardně) spuštěna s tímto uživatelem:

source: You’ll also take this opportunity to move the work to be based off the project’s current `master` branch.
cs: Vy tuto příležitost využijete zároveň k tomu, abyste práci přesunuli tak, aby byla založena na aktuálním stavu projektu ve větvi `master`.

source: You’ll be able to watch Git rewriting trees and commits and then move the branch pointer at the end.
cs: Uvidíte, jak Git přepisuje stromy a revize a poté přemístí ukazatel větve na konec.

source: You’ll build client scripts that help the developer know if their push will be rejected and server scripts that actually enforce the policies.
cs: V této části vytvoříte skripty pro klienta, které vývojářům pomohou zjistit, zda budou jejich revize odmítnuty, a skripty na server, které si specifikované požadavky přímo vynutí.

source: You’ll change into each subdirectory and print the commands necessary to export it.
cs: Přejdete do každého podadresáře a zadáte příkazy potřebné k jeho exportu.

source: You’ll determine the path of the object you want to write out (the first two characters of the SHA-1 value being the subdirectory name, and the last 38 characters being the filename within that directory).
cs: Musíte tu určit cestu k objektu, který chcete zapsat (první dva znaky hodnoty SHA-1 budou název podadresáře, zbývajících 38 znaků bude tvořit název souboru v tomto adresáři).

source: You’ll do the following:
cs: Uděláte následující:

source: You’ll do this by creating an array of directories and using the index value as the mark, because a mark must be an integer.
cs: Provedete to tak, že vytvoříte skupinu adresářů a jako označovač použijete hodnotu indexu, neboť označovač musí být celé číslo.

source: You’ll follow these steps:
cs: Budete provádět tyto kroky:

source: You’ll have the `update` hook look at those rules, see what files are being introduced for all the commits being pushed, and determine whether the user doing the push has access to update all those files.
cs: Zásuvný modul `update` se podívá na tato pravidla, zjistí, jaké soubory byly ve všech odesílaných revizích doručeny, a určí, zda má odesílatel oprávnění aktualizovat všechny tyto soubory.

source: You’ll have to pull down their work first and incorporate it into yours before you’ll be allowed to push.
cs: Nejprve musíte stáhnout práci ostatních a začlenit ji do své, teprve potom vám server umožní odeslání.

source: You’ll learn a few of the common uses so you can get an idea of some of the things it’s capable of.
cs: Dále poznáte několik běžných situací, v nichž ho lze použít, a získáte tak představu, co všechno příkaz dovede.

source: You’ll learn how to be a benevolent dictator or integration manager.
cs: Dozvíte se, jak být benevolentním diktátorem nebo integračním manažerem.

source: You’ll learn how to import data from two of the bigger professionally used SCM systems — Subversion and Perforce — both because they make up the majority of users I hear of who are currently switching, and because high-quality tools for both systems are distributed with Git.
cs: Nyní se naučíte, jak importovat data ze dvou větších, profesionálně používaných systémů SCM -- Subversion a Perforce. Oba tyto systémy jsem zvolil proto, že podle mých informací přechází na Git nejvíce uživatelů právě z nich, a také proto, že Git obsahuje vysoce kvalitní nástroje právě pro oba tyto systémy.

source: You’ll learn how to work in an environment where small groups collaborate on features and then those team-based contributions are integrated by another party.
cs: Naučíte se, jak pracovat v prostředí, v němž na jednotlivých úkolech spolupracují malé skupiny a tyto týmové příspěvky jsou poté integrovány druhou stranou.

source: You’ll learn more about `read-tree` and its friends in Chapter 9, but for now know that it reads the root tree of one branch into your current staging area and working directory.
cs: O příkazu `read-tree` a jeho příbuzných se více dočtete v kapitole 9, nyní však vězte, že načte kořenový strom jedné větve do vaší aktuální oblasti připravených změn a do pracovního adresáře.

source: You’ll learn more about what this means in a bit.
cs: Tomu, co tato definice znamená, se budeme věnovat za chvíli.

source: You’ll likely need to change that to whatever your stable, published branch is.
cs: Pravděpodobně ho budete muset změnit na název stabilní, zveřejněné větve.

source: You’ll notice the phrase "Fast-forward" in that merge.
cs: Při sloučení jste si možná všimli spojení „Fast forward“ (rychle vpřed).

source: You’ll now create a new tree with the second version of test.txt and a new file as well:
cs: Nyní vytvoříte nový strom s druhou verzí souboru test.txt a jedním novým souborem (new.txt):

source: You’ll now look at each of these sections in detail to see how Git operates.
cs: Na každou z těchto částí se teď podíváme podrobněji, abyste pochopili, jak Git pracuje.

source: You’ll often want to do two basic things to your last commit: change the commit message, or change the snapshot you just recorded by adding, changing and removing files.
cs: Na poslední revizi budete často chtít měnit dvě věci: zprávu k revizi nebo čerstvě zapsaný snímek, v němž budete chtít přidat, změnit nebo odstranit soubory.

source: You’ll rarely want `color.ui = always`.
cs: Možnost `color.ui = always` využijete zřídka.

source: You’ll see a remote rejected message for each reference that your hook declined, and it tells you that it was declined specifically because of a hook failure.
cs: Pro každou referenci, kterou váš zásuvný modul odmítne, se zobrazí jedna zpráva o odmítnutí vzdálené reference. Ze zprávy vyčtete, že byla reference odmítnuta kvůli chybě zásuvného modulu.

source: You’ll see how to store a blob object — in this case, the string "what is up, doc?" — interactively in the Ruby scripting language.
cs: Uvidíte, jak lze uložit objekt blobu – v našem případě řetězec „what is up, doc?“ – interaktivně v skriptovacím jazyce Ruby.

source: You’ll spend the first part of this chapter learning about `git svn`, the bidirectional Subversion gateway tool in Git.
cs: První část této kapitoly proto věnujeme nástroji `git svn`, obousměrné bráně k systému Subversion.

source: You’ll start with the `git svn clone` command, which imports an entire Subversion repository into a local Git repository.
cs: Začneme příkazem `git svn clone`, který importuje celý repozitář Subversion do lokálního repozitáře Git.

source: You’ll use a Perl expression to clean that up on commit:
cs: Při operaci clean během zapsání pak budete používat výraz Perlu:

source: You’re also unlikely to want to have hundreds of remotes, each for someone who contributes only a patch or two.
cs: Pravděpodobně také nebudete chtít mít nastaveny stovky vzdálených serverů, z nichž byste dostávali po jednom nebo dvou záplatách.

source: You’re likely to have to either include this code from a shared library like a CPAN install or Ruby gem, or copy the source code into your own project tree.
cs: Pravděpodobně budete muset použít tento kód ze sdílené knihovny, jako CPAN install nebo Ruby gem, nebo zkopírovat zdrojový kód do vlastního stromu projektu.

source: You’re looking for a pair of files named something and something.pub, where the something is usually `id_dsa` or `id_rsa`.
cs: Zobrazí se několik souborů s názvem `xxx` a `xxx.pub`, kde `xxx` je většinou `id_dsa` nebo `id_rsa`.

source: You’re looking for any commit that is reachable from the last commit on the remote and that isn’t reachable from any parent of any of the SHAs you’re trying to push up — meaning it’s a fast-forward.
cs: Vyhledáváte všechny revize, které jsou dostupné z poslední revize na vzdáleném serveru a nejsou dostupné z žádného rodiče jakékoli hodnoty SHA, kterou se pokoušíte odeslat. Tímto způsobem lze označit odeslání „rychle vpřed“.

source: You’re ready to go — nothing else needed.
cs: Vše je připraveno, nic dalšího se od vás nevyžaduje.

source: You’re ready to roll.
cs: Teď to můžete rozjet.

source: You’re taken to the Create a New Repository form (see Figure 4-5).
cs: Přejdete tím na formulář „Create a New Repository“ (viz obrázek 4-5).

source: You’ve accomplished the basic tasks of tracking and committing files, and you’ve harnessed the power of the staging area and lightweight topic branching and merging.
cs: Zvládli jste základní úkony sledování a zapisování souborů a pochopili jste přednosti přípravy souborů k zapsání i snadného vytváření a začleňování větví.

source: You’ve covered most of the major ways that you can customize your Git client and server to best fit your workflow and projects.
cs: Už jsme se seznámili s většinou hlavních způsobů přizpůsobení klienta a serveru systému Git tak, aby co nejlépe odpovídali potřebám vašeho pracovního postupu a vašich projektů.

source: You’ve decided that you’re going to work on issue #53 in whatever issue-tracking system your company uses.
cs: Rozhodli jste se, že budete pracovat na chybě č. 53, ať už vaše společnost používá jakýkoli systém sledování chyb.

source: You’ve effectively lost the top two commits — you have no branch from which those commits are reachable.
cs: Účinně jsme se zbavili horních dvou revizí. Neexistuje žádná větev, z níž by byly tyto revize dostupné.

source: You’ve halved your disk usage by packing your objects.
cs: Zabalením objektů jste zredukovali nároky na místo na polovinu.

source: You’ve just done the low-level operations to build up a Git history without using any of the front ends.
cs: Právě jste vytvořili historii Git jen na základě nízkoúrovňových operací, bez použití front-endů.

source: You’ve just gone over Git’s three main object types, but there is a fourth.
cs: Už jsme se seznámili se třemi základními typy objektů. Jenže existuje ještě čtvrtý.

source: You’ve learned about all sorts of configuration settings, file-based attributes, and event hooks, and you’ve built an example policy-enforcing server.
cs: Poznali jste všechny druhy konfiguračního nastavení, atributy nastavované pomocí souborů a dokonce i zásuvné moduly. V neposlední řadě jste sestavili ukázkový server, který si sám dokáže vynutit vámi předepsané standardy.

source: You’ve partially staged this file.
cs: Soubor je částečně připraven k zapsání.
